hljs.highlightAll();

console.log('Самооценка: 160 / 150: \n' + 
'- вёрстка валидная +10 \n' +
'- вёрстка семантическая +20 (больше 10 тегов, как заголовков, так и тематических) \n' +
'- для оформления CV используются CSS-стили +10 \n' +
'- контент отцентрирован по середине страницы +10 \n' +
'- вёрстка адаптивная вплоть до 320px +10 \n' +
'- присутствует адаптивное бургер-меню(доступно при разрешении менее 767px) +10 \n' +
'- фото автора присутствует, с тегом alt +10 \n' +
'- контакты для связи и перечень навыков оформлены списком ul>li +10 \n' +
'- CV содержит контакты для связи, краткую информацию о себе, перечень навыков, информацию об образовании и уровне английского +10 \n' +
'- присутствует пример кода с подсветкой +10 \n' +
'- присутствуют изображения-ссылки на выполненные проекты с названием, перечнем технологий +10 \n' +
'- резюме выполнено на английском языке +10 \n' +
'- выполнены требования к Pull Request +10 \n' +
'- есть видеорезюме автора на английском языке +10 \n' +
'- дизайн хорошего качества +10');

function showMenu() {
  document.getElementById("dropdown-list").classList.toggle("show");
}

window.onclick = function(event) {
  if (!event.target.matches('.drop-button')) {
    let dropdowns = document.getElementsByClassName("dropdown-content");
    for (let i = 0; i < dropdowns.length; i++) {
      let openDropdown = dropdowns[i];
      if (openDropdown.classList.contains('show')) {
        openDropdown.classList.remove('show');
      }
    }
  }
}